{
    "0": {
        "text": "Твой первый день в роли системного аналитика в 'TechSolve'. Сегодня ты знакомишься с командой и ознакамливаешься с проектом 'Alpha'. Первый важный шаг - понять ключевые потребности проекта и ожидания клиентов. Ты решаешь, как подойти к этому заданию. Как ты начнешь?",
        "image": "/static/images/image1.jpg",
        "options": [
            {
                "text": "Сначала провести встречу с командой",
                "effects": {
                    "reputation": 1,
                    "resources": 0,
                    "satisfaction": -1
                },
                "consequences": "Ты получил ценные внутренние взгляды, но задержал первое взаимодействие с клиентом, что немного снизило их удовлетворенность."
            },
            {
                "text": "Начать с встречи с клиентом",
                "effects": {
                    "reputation": 0,
                    "resources": -1,
                    "satisfaction": 2
                },
                "consequences": "Ты узнал ожидания клиента напрямую, но из-за этого упустил время на внутреннюю подготовку и координацию с командой."
            }
        ]
    },
    "1": {
        "text": "После твоего первого шага на проекте 'Alpha' в 'TechSolve', теперь перед тобой стоит задача разработки первоначального плана проекта. Ты сталкиваешься с выбором: сосредоточиться на детальном анализе требований проекта или быстро перейти к планированию с минимальной информацией, чтобы ускорить процесс. Какой подход ты выберешь?",
        "image": "/static/images/image2.jpg",
        "options": [
            {
                "text": "Детальный анализ требований",
                "effects": {
                    "reputation": 1,
                    "resources": -1,
                    "satisfaction": 1
                },
                "consequences": "Ты тщательно изучил требования, что улучшило качество плана, но потребовало дополнительного времени."
            },
            {
                "text": "Быстрое планирование",
                "effects": {
                    "reputation": -1,
                    "resources": 1,
                    "satisfaction": -1
                },
                "consequences": "Ты быстро перешел к планированию, экономя время и ресурсы, но из-за недостатка информации качество плана оказалось ниже ожиданий."
            }
        ]
    },
    "2": {
        "text": "В проекте 'Alpha' наступил критический момент. Открылась возможность интегрировать новейшую технологию, которая может значительно улучшить проект, но она не проверена и может повлечь большие риски. Твой выбор здесь может кардинально изменить ход проекта. Ты решаешь...",
        "image": "/static/images/image3.jpg",
        "options": [
            {
                "text": "Интегрировать новейшую технологию",
                "effects": {
                    "reputation": -50,
                    "resources": -30,
                    "satisfaction": 50
                },
                "consequences": "Интеграция новой технологии привела к значительным трудностям и потере ресурсов, но в итоге удивительно улучшила проект, восхищая клиентов."
            },
            {
                "text": "Избегать рисков и придерживаться плана",
                "effects": {
                    "reputation": 10,
                    "resources": 20,
                    "satisfaction": -10
                },
                "consequences": "Твой выбор избежать риска и следовать плану обеспечил стабильность проекта, но упустил возможность его значительного улучшения, что разочаровало некоторых клиентов."
            }
        ]
    },
    "3": {
        "text": "Проект 'Alpha' продвигается, и ты сталкиваешься с задачей анализа большого объема данных. Перед тобой стоит выбор: использовать проверенный подход с помощью традиционных методов анализа или применить новую аналитическую технику, которую ты недавно изучил. Твой выбор может повлиять на скорость и качество анализа. Как ты поступишь?",
        "image": "/static/images/image4.jpg",
        "options": [
            {
                "text": "Использовать традиционные методы",
                "effects": {
                    "reputation": 1,
                    "resources": 1,
                    "satisfaction": 0
                },
                "consequences": "Твой выбор использовать традиционные методы обеспечил надежность и точность, но не позволил в полной мере раскрыть потенциал данных."
            },
            {
                "text": "Применить новую аналитическую технику",
                "effects": {
                    "reputation": 0,
                    "resources": -1,
                    "satisfaction": 2
                },
                "consequences": "Применение новой техники оказалось рискованным, но в итоге раскрыло неожиданные возможности данных, что очень понравилось клиентам."
            }
        ]
    },
    "4" : {
        "text": "В рамках проекта 'Alpha' тебе предстоит встреча с главным архитектором компании. Он известен своими каверзными вопросами и критическим подходом. На встрече он задает сложный вопрос о техническом решении, который ты предложил. Как ты отреагируешь?",
        "image": "/static/images/image5.jpg",
        "options": [
            {
                "text": "Спокойно и подробно объяснить решение",
                "effects": {
                    "reputation": 2,
                    "resources": 0,
                    "satisfaction": -1
                },
                "consequences": "Твой спокойный и основательный ответ укрепил твою репутацию как эксперта, но из-за затраченного времени на детали некоторые клиенты остались менее удовлетворены."
            },
            {
                "text": "Кратко и ясно изложить основные моменты",
                "effects": {
                    "reputation": -1,
                    "resources": 2,
                    "satisfaction": 1
                },
                "consequences": "Твой краткий ответ показал уверенность и способность к эффективной коммуникации, но главный архитектор остался не полностью удовлетворен глубиной твоих объяснений."
            }
        ]
    },
    "5" : {
        "text": "На поздней стадии проекта 'Alpha' выявляется серьезная проблема: текущее техническое решение не полностью соответствует новым требованиям клиента. У тебя есть два пути: либо переработать текущее решение, рискуя сроками и бюджетом, либо убедить клиента в эффективности существующего решения, рискуя их удовлетворенностью. Твой выбор критичен. Как ты поступишь?",
        "image": "/static/images/image6.jpg",
        "options": [
            {
                "text": "Переработать техническое решение",
                "effects": {
                    "reputation": 5,
                    "resources": -5,
                    "satisfaction": 5
                },
                "consequences": "Твое решение переработать проект улучшило его качество и удовлетворило клиента, но потребовало значительных дополнительных ресурсов и времени."
            },
            {
                "text": "Убедить клиента в текущем решении",
                "effects": {
                    "reputation": -5,
                    "resources": 5,
                    "satisfaction": -5
                },
                "consequences": "Ты сэкономил время и ресурсы, убедив клиента в эффективности текущего решения, но это снизило твою репутацию и уровень удовлетворенности клиента из-за компромиссов в качестве."
            }
        ]
    },
    "6" : {
        "text": "В критический момент проекта 'Alpha' возникает неожиданная проблема: одна из ключевых технологий, которую ты выбрал, оказывается патентованной конкурентом, и теперь вокруг проекта возникают юридические сложности. Тебе необходимо решить: или быстро найти альтернативное решение, рискуя качеством проекта, или вести переговоры с конкурентом о лицензировании, рискуя бюджетом и временем. Как ты поступишь?",
        "image": "/static/images/image7.jpg",
        "options": [
            {
                "text": "Искать альтернативное решение",
                "effects": {
                    "reputation": -20,
                    "resources": 0,
                    "satisfaction": 5
                },
                "consequences": "Твой выбор найти альтернативное решение быстро решил юридический вопрос, но существенно снизил качество проекта, что повлияло на твою репутацию."
            },
            {
                "text": "Вести переговоры о лицензировании",
                "effects": {
                    "reputation": 5,
                    "resources": -20,
                    "satisfaction": -5
                },
                "consequences": "Переговоры о лицензировании заняли много времени и ресурсов, но позволили сохранить качество проекта, хотя и снизили удовлетворенность клиента из-за задержек."
            }
        ]
    },
    "7" : {
        "text": "В рамках ежедневных задач по проекту 'Alpha' тебе предстоит выбрать способ сбора обратной связи от пользователей. Ты решаешь между онлайн-опросом и персональными интервью. Кажется, что это простой выбор, но он может значительно повлиять на восприятие проекта пользователями. Какой метод ты выберешь?",
        "image": "/static/images/image8.jpg",
        "options": [
            {
                "text": "Онлайн-опрос",
                "effects": {
                    "reputation": -5,
                    "resources": 5,
                    "satisfaction": -20
                },
                "consequences": "Выбор онлайн-опроса экономит время и ресурсы, но приводит к получению поверхностной обратной связи, что существенно снижает удовлетворенность клиентов."
            },
            {
                "text": "Персональные интервью",
                "effects": {
                    "reputation": 20,
                    "resources": -5,
                    "satisfaction": 5
                },
                "consequences": "Выбор персональных интервью требует больше времени и ресурсов, но обеспечивает глубокое понимание потребностей пользователей, что значительно повышает удовлетворенность клиентов."
            }
        ]
    },
    "8" :      {
        "text": "В рабочий день по проекту 'Alpha' тебе предстоит выбрать способ документирования и отчетности работы. Ты решаешь между подробным документированием каждого этапа проекта или краткой отчетностью, охватывающей только ключевые моменты. Этот выбор влияет на то, как информация будет доступна команде и клиентам. Какой подход ты выберешь?",
        "image": "/static/images/image9.jpg",
        "options": [
            {
                "text": "Подробное документирование",
                "effects": {
                    "reputation": 2,
                    "resources": -2,
                    "satisfaction": 1
                },
                "consequences": "Твой выбор подробно документировать работу обеспечил полную прозрачность и улучшил понимание проекта, но потребовал дополнительных ресурсов."
            },
            {
                "text": "Краткая отчетность",
                "effects": {
                    "reputation": -1,
                    "resources": 2,
                    "satisfaction": -1
                },
                "consequences": "Твой выбор краткой отчетности сэкономил время и ресурсы, но оставил некоторые детали без внимания, что привело к уменьшению понимания проекта у команды и клиентов."
            }
        ]
    },
    "9" : {
        "text": "После напряженной недели работы над проектом 'Alpha', ты ощущаешь признаки усталости. Перед тобой стоит выбор: поработать в выходные для завершения важного этапа проекта или взять выходные для отдыха и восстановления сил. Твое решение повлияет на твою продуктивность и восприятие командой и клиентами. Как ты поступишь?",
        "image": "/static/images/image10.jpg",
        "options": [
            {
                "text": "Работать в выходные",
                "effects": {
                    "reputation": 2,
                    "resources": 1,
                    "satisfaction": -2
                },
                "consequences": "Твой выбор поработать в выходные ускорил проект, но уменьшил твою эффективность на следующей неделе и снизил общее удовлетворение работой."
            },
            {
                "text": "Взять выходные для отдыха",
                "effects": {
                    "reputation": -1,
                    "resources": -1,
                    "satisfaction": 3
                },
                "consequences": "Твой выбор взять выходные для отдыха помог восстановить силы, улучшив твою продуктивность и повысив удовлетворенность работой в долгосрочной перспективе."
            }
        ]
    },
    "10" : {
        "text": "В процессе работы над проектом 'Alpha' возникает разногласие между тобой и командой разработчиков относительно одного из технических решений. Ты стоишь перед выбором: настоять на своем видении, что может улучшить проект, но усугубить отношения с командой, или идти на компромисс с разработчиками, что может укрепить командную работу, но потенциально ухудшить качество проекта. Как ты поступишь?",
        "image": "/static/images/image11.jpg",
        "options": [
            {
                "text": "Настоять на своем видении",
                "effects": {
                    "reputation": 2,
                    "resources": 0,
                    "satisfaction": -2
                },
                "consequences": "Твой выбор настоять на своем подходе улучшил проект, но создал напряжение в команде и снизил их мотивацию и удовлетворенность работой."
            },
            {
                "text": "Идти на компромисс с разработчиками",
                "effects": {
                    "reputation": -1,
                    "resources": 0,
                    "satisfaction": 3
                },
                "consequences": "Твой выбор идти на компромисс укрепил отношения с командой и повысил общую удовлетворенность, но внес некоторые уступки в техническое решение."
            }
        ]
    }, 
    "11" : {
        "text": "На одной из рутинных встреч по проекту 'Alpha' тебя просят дать краткую оценку текущего прогресса. Ты стоишь перед выбором: либо представить оптимистичный отчет, подчеркивая достигнутые успехи, либо реалистичный, указывая на возможные риски и задержки. Этот выбор, кажущийся простым, может иметь неожиданные последствия для доверия клиентов и команды.",
        "image": "/static/images/image12.jpg",
        "options": [
            {
                "text": "Представить оптимистичный отчет",
                "effects": {
                    "reputation": -20,
                    "resources": 0,
                    "satisfaction": -5
                },
                "consequences": "Оптимистичный отчет в краткосрочной перспективе улучшил настроение, но позднее привел к потере доверия, когда реальные проблемы проекта стали очевидны."
            },
            {
                "text": "Представить реалистичный отчет",
                "effects": {
                    "reputation": 20,
                    "resources": 0,
                    "satisfaction": 5
                },
                "consequences": "Реалистичный отчет изначально вызвал беспокойство, но в долгосрочной перспективе повысил доверие к тебе как к аналитику, ценящему прозрачность и честность."
            }
        ]
    },
    "12" : {
        "text": "В процессе реализации проекта 'Alpha' происходит неожиданный сбой: система безопасности, которая считалась надежной, подвергается успешной кибератаке. Это ставит под угрозу конфиденциальность данных клиента. Тебе нужно решить: либо немедленно сообщить клиенту о произошедшем, рискуя репутацией и доверием, либо сначала попытаться устранить проблему, чтобы минимизировать потенциальный ущерб перед тем, как сообщить о ситуации.",
        "image": "/static/images/image13.jpg",
        "options": [
            {
                "text": "Немедленно сообщить клиенту",
                "effects": {
                    "reputation": -5,
                    "resources": -5,
                    "satisfaction": 20
                },
                "consequences": "Твой выбор немедленно сообщить клиенту об инциденте усилил доверие к тебе как к ответственному специалисту, но повлиял на репутацию компании из-за уязвимости системы."
            },
            {
                "text": "Сначала устранить проблему",
                "effects": {
                    "reputation": 5,
                    "resources": -20,
                    "satisfaction": -10
                },
                "consequences": "Твой выбор сначала решить проблему и затем сообщить клиенту помог минимизировать немедленный ущерб, но когда клиент узнал о задержке информирования, это негативно сказалось на их удовлетворенности и доверии."
            }
        ]
    }, 
    "13" : {
        "text": "В рамках проекта 'Alpha' ты сталкиваешься с задачей анализа сложного бизнес-процесса клиента. Перед тобой стоит выбор: либо использовать стандартные методы моделирования процессов, которые займут больше времени, но более точны, либо применить новый, более быстрый подход, который ты недавно изучил, но который еще не проверен в практике. Этот выбор повлияет на качество анализа и восприятие твоей работы клиентом и командой.",
        "image": "/static/images/image14.jpg",
        "options": [
            {
                "text": "Использовать стандартные методы",
                "effects": {
                    "reputation": 2,
                    "resources": -2,
                    "satisfaction": 1
                },
                "consequences": "Выбор стандартных методов гарантировал точность и глубину анализа, но занял дополнительное время, что чуть затянуло проект."
            },
            {
                "text": "Применить новый подход",
                "effects": {
                    "reputation": -1,
                    "resources": 2,
                    "satisfaction": -2
                },
                "consequences": "Твой выбор нового подхода сэкономил время, но недостаток проверки в практике привел к ошибкам в анализе, что снизило удовлетворенность клиента."
            }
        ]
    },
    "14" : {
        "text": "В процессе работы над проектом 'Alpha' ты обнаруживаешь, что используемые технологии не полностью соответствуют последним стандартам безопасности данных. Тебе нужно решить: либо обновить систему до последних стандартов, что потребует времени и ресурсов, но гарантирует безопасность, либо продолжить использовать текущую конфигурацию для сохранения ресурсов и сроков, рискуя потенциальными проблемами безопасности в будущем.",
        "image": "/static/images/image15.jpg",
        "options": [
            {
                "text": "Обновить систему до последних стандартов",
                "effects": {
                    "reputation": 3,
                    "resources": -3,
                    "satisfaction": 2
                },
                "consequences": "Твой выбор обновить систему улучшил безопасность проекта и повысил удовлетворенность клиента, но потребовал дополнительных ресурсов и времени."
            },
            {
                "text": "Продолжить использовать текущую конфигурацию",
                "effects": {
                    "reputation": -3,
                    "resources": 3,
                    "satisfaction": -2
                },
                "consequences": "Твое решение продолжить использовать текущую конфигурацию сэкономило время и ресурсы, но в долгосрочной перспективе повлекло проблемы с безопасностью данных и снизило удовлетворенность клиентов."
            }
        ]
    }, 
    "15": {
        "text": "В рамках проекта 'Alpha' тебе необходимо извлечь специфические данные из большой базы данных клиента. Ты стоишь перед выбором: использовать сложный SQL запрос, который точно извлечет нужные данные, но потребует больше времени для написания и тестирования, или применить более простой запрос, который быстрее, но может не полностью охватить все необходимые данные. Какой подход ты выберешь?",
        "image": "/static/images/image16.jpg",
        "options": [
            {
                "text": "Использовать сложный SQL запрос",
                "effects": {
                    "reputation": 2,
                    "resources": -2,
                    "satisfaction": 2
                },
                "consequences": "Твой выбор использовать сложный запрос обеспечил точность и полноту данных, но потребовал дополнительного времени для подготовки и тестирования."
            },
            {
                "text": "Применить простой SQL запрос",
                "effects": {
                    "reputation": -1,
                    "resources": 2,
                    "satisfaction": -2
                },
                "consequences": "Твой выбор простого запроса позволил быстро получить результаты, но они оказались неполными, что привело к недостаточной информации для анализа и снижению удовлетворенности клиента."
            }
        ]
    }, 
    "16" : {
        "text": "При разработке технической спецификации проекта 'Alpha' ты осознаешь, что нефункциональные требования не были полностью учтены. Перед тобой стоит выбор: потратить дополнительное время на детальное исследование и документирование этих требований, что может задержать проект, или продолжить работу без полного учета нефункциональных требований, чтобы удержаться в рамках сроков. Как ты поступишь?",
        "image": "/static/images/image17.jpg",
        "options": [
            {
                "text": "Детально исследовать нефункциональные требования",
                "effects": {
                    "reputation": 3,
                    "resources": -3,
                    "satisfaction": 2
                },
                "consequences": "Твое решение уделить внимание нефункциональным требованиям увеличило время разработки, но гарантировало более высокое качество и надежность проекта."
            },
            {
                "text": "Продолжить без полного учета нефункциональных требований",
                "effects": {
                    "reputation": -2,
                    "resources": 2,
                    "satisfaction": -3
                },
                "consequences": "Твой выбор продолжить без полного учета нефункциональных требований позволил соблюсти сроки, но привел к проблемам с производительностью и удобством использования в дальнейшем."
            }
        ]
    }                                               
}
